{
  "basics": {
    "name": "Francisco Cerdas Ureña",
    "label": "Web Developer",
    "picture": "https://portrait-personal.s3.amazonaws.com/profile.jpg",
    "email": "chicus12@gmail.com",
    "phone": "(+506) 8714-0634",
    "website": "https://github.com/chicus12",
    "summary": "As an experienced developer, I navigate the entire software life cycle with proficiency, seamlessly guiding projects from conception to product release while adeptly working with a variety of programming languages.<br>Presently, I specialize in crafting dynamic and efficient solutions using TypeScript, NodeJS, and React, as well as frameworks like Next and Remix for enhanced efficiency and functionality.<br>With a keen eye for detail and a commitment to staying at the forefront of web development technologies, I thrive in creating seamless and engaging user experiences. My dedication to clean code, problem-solving, and continuous learning fuels my enthusiasm for building innovative and scalable web applications.<br>My commitment to continuous learning is evident in my exploration of diverse languages such as Go and Python, always seeking new approaches to elevate my skill set. Embracing collaborative environments, I am an advocate for passion-driven development, emphasizing the importance of teamwork and the application of modern software patterns.",
    "profiles": [
      {
        "network": "linkedin",
        "username": "franciscocerdas",
        "url": "https://www.linkedin.com/in/franciscocerdas"
      },
      {
        "network": "github",
        "username": "chicus12",
        "url": "https://github.com/chicus12"
      }
    ]
  },
  "work": [
    {
      "company": "SOIN",
      "position": "Full Stack Developer",
      "website": "http://www.soin.co.cr",
      "startDate": "2011-05-15",
      "endDate": "2023-08",
      "summary": "SOIN its an IT company with national prestige.",
      "highlights": ["test"],
      "positions": [
        {
          "title": "Software Developer",
          "startDate": "2019-12",
          "endDate": "2023-08",
          "summary": "As an integral member of a dynamic web development team, I contributed to the creation of multiple applications for esteemed government institutions in Costa Rica. Notable projects include those for Dirección General de Migración y Extranjería, Servicio Fitosanitario del Estado, and pivotal platforms such as tramiteya.go.cr/crearempresa for the seamless registration and activation of businesses, as well as registrelo.go.cr, a comprehensive System for the Registration of Foods and Raw Materials.",
          "highlights": [
            "Software Developer Specialist",
            "Fullstack Developer",
            "Backend Developer",
            "Frontend Developer",
            "React Dedeveloper",
            "NodeJS Dedeveloper",
            "Technical Support Engineer",
            "Developer Success Engineer",
            "Code Review Specialist"
          ]
        },
        {
          "title": "Software Developer - Fan-Fam App",
          "startDate": "2019-10",
          "endDate": "2019-12",
          "summary": "I was actively involved in the development of Fan-Fam, an subscription-based app designed for music bands. This innovative platform allowed fans to conveniently purchase music and merchandise directly from their favorite bands. Currently it is no longer available, Fan-Fam was poised to revolutionize the fan experience, providing a seamless and engaging platform for music enthusiasts and artists alike.",
          "highlights": [
            "RESTs API Architect",
            "Serverless NodeJS Developer",
            "AWS Lambda",
            "React Developer"
          ]
        },
        {
          "title": "Software Developer / Web Engineer Lead - TSA App",
          "startDate": "2019-01",
          "endDate": "2019-10",
          "summary": "I played a key role in the development of TSA, an acronym for 'Registration of Early Summary Transmission and Risk Management.' TSA is a sophisticated web application designed for customs risk management, grounded in the data model established by the World Customs Organization (WCO). My contributions to the project encompassed ensuring the seamless integration of functionalities and adherence to the WCO data model, thereby enhancing the effectiveness of customs risk management procedures.",
          "highlights": [
            "Project scaffold Architect",
            "RESTs API Architect",
            "Code Review Specialist",
            "Release Manager",
            "Fullstack Developer",
            "NodeJS Developer",
            "React Developer",
            "Technical Support Engineer",
            "Developer Success Engineer"
          ]
        },
        {
          "title": "Software Developer - React Form Converter",
          "startDate": "2018-10",
          "endDate": "2019-01",
          "summary": "It's a simple tool to convert simple HTML form to React Forms",
          "highlights": [
            "Software Architect",
            "NodeJS Developer",
            "React Developer",
            "Proficiency teaching sessions for developers about the tool"
          ]
        },
        {
          "title": "Software Developer / Web Engineer Lead - Tapp App",
          "startDate": "2015-04",
          "endDate": "2018-10",
          "summary": "As a web developer for TAPP, I played a crucial role in the creation of an innovative app that transformed the landscape of customer loyalty programs. TAPP served as a comprehensive platform, allowing users to digitally store their preferred frequent customer cards. Users could accrue points for their purchases, with the flexibility to redeem them for prizes or utilize them as redeemable currency for in-store products. TAPP swiftly emerged as the leading loyalty service in Costa Rica, boasting a substantial user base of thousands on a daily basis. My contributions to TAPP encompassed the development of key features, contributing to its success in enhancing customer engagement and loyalty within the region.",
          "highlights": [
            "RESTs API Architect",
            "Web Development Team Leader",
            "POS Integration and Implementation Manager",
            "Code Review Specialist",
            "Release Manager",
            "NodeJs Developer",
            "Frontend Developer - BackboneJS"
          ]
        },
        {
          "title": "Software Developer / Web Engineer Lead - Digital Rx",
          "startDate": "2014-02",
          "endDate": "2015-04",
          "summary": "As a developer, I contributed to the creation of a pivotal platform utilized by the Costa Rica Health Ministry. This platform, known as Digital Rx (Receta Digital), plays a crucial role in managing and overseeing the prescription, marketing, and distribution processes of psychotropic and narcotic drugs. Digital Rx excels in seamlessly integrating information generated throughout these processes, empowering the Health Ministry to conduct precise and effective administration of psychotropic and narcotic drugs in our country. My role in the development of Digital Rx involved implementing robust features to enhance the functionality and efficiency of this critical healthcare management tool from the begining.",
          "highlights": [
            "Software Engineering Architect",
            "Collaborated closely with the product owner to define and set clear milestones and deadlines for development initiatives. Ensured alignment with strategic goals, fostering effective communication and facilitating a streamlined workflow to achieve project objectives within specified timelines.",
            "Web Development Team Leader",
            "Backend Developer - Coldfusion",
            "FrontEnd Developer - Jquery + HTML"
          ]
        },
        {
          "title": "Software Developer - Quecomemos App",
          "startDate": "2013-01",
          "endDate": "2014-02",
          "summary": "As a web developer at Quecomemos, I played a pivotal role in creating the first app for ordering food from leading food chains in Costa Rica. This platform, utilized by thousands of users, emerged as the largest and most prominent food delivery app in the region. My contributions to Quecomemos included designing and implementing features that enhanced the user experience, contributing to the app's widespread adoption and success.",
          "highlights": [
            "Fullstack Developer",
            "RESTs API Architect",
            "Backend Developer - ColdFusion",
            "FrontEnd Developer - Jquery + HTML"
          ]
        },
        {
          "title": "Software Developer - ERP Software",
          "startDate": "2011-05",
          "endDate": "2013-01",
          "summary": "As a key member of the web development team, I contributed to the creation of an Enterprise Resource Planning (ERP) Web Application utilized by prominent entities such as Televisa, Bimbo, P.M.I PEMEX, and government institutions in Costa Rica. My role involved collaborating with cross-functional teams to design and implement features that met the specific needs of these diverse organizations, ensuring the seamless integration and effective utilization of the ERP system across various sectors and industries.",
          "highlights": [
            "Fullstack Developer",
            "Backend Developer - Coldfusion",
            "Frontend Developer - Jquery + HTML"
          ]
        }
      ]
    }
  ],
  "volunteer": [
    {
      "organization": "SOIN University",
      "position": "Teacher",
      "website": "http://www.soin.co.cr",
      "startDate": "2017-05-20",
      "endDate": "2017-06-24",
      "summary": "NodeJS Professional Course.",
      "highlights": [
        "NodeJS basics",
        "Express",
        "MongoDB",
        "Redis",
        "Socket.io",
        "Unit Test & TDD",
        "Module Patterns",
        "APIs REST",
        "Async Javascript"
      ]
    }
  ],
  "education": [
    {
      "institution": "University of Costa Rica",
      "area": "Business Computing",
      "studyType": "Bachelor Degree",
      "startDate": "2007-01-01",
      "endDate": "2010-12-01",
      "gpa": "4.0",
      "courses": []
    },
    {
      "institution": "Scrum Alliance",
      "area": "Scrum",
      "studyType": "Scrum Master",
      "startDate": "2014-06-01",
      "endDate": "2014-06-30",
      "gpa": "4.0",
      "courses": ["Scrum Master - License 000339588"]
    },
    {
      "institution": "Veritas University",
      "area": "Introduction to Arduino",
      "studyType": "Course",
      "startDate": "2017-06-01",
      "endDate": "2017-06-30",
      "courses": ["Arduino 101"]
    }
  ],
  "awards": [
    {
      "title": "Most inovative Product of 2016",
      "date": "2016-01-01",
      "awarder": "Chamber of Commerce",
      "summary": "Tapp"
    }
  ],
  "skills": [
    {
      "name": "Web Development",
      "level": "High",
      "keywords": [
        "HTML5",
        "A11y",
        "Javascript",
        "Typescript",
        "NodeJS",
        "React",
        "Next",
        "Remix",
        "Vite",
        "Vitest",
        "Tailwind CSS",
        "Playwright"
      ]
    },
    {
      "name": "Data Bases",
      "level": "High",
      "keywords": ["MySQL", "PostgreSQL", "Oracle", "MongoDB", "Redis"]
    },
    {
      "name": "Development Methodologies",
      "level": "High",
      "keywords": [
        "Passion Driven Development",
        "Test Driven Development",
        "Scrum Master"
      ]
    },
    {
      "name": "DevOps",
      "level": "Medium",
      "keywords": [
        "NGINX",
        "Docker",
        "Container",
        "AWS Amazon Web Services",
        "Digital Ocean",
        "UNIX terminal"
      ]
    }
  ],
  "languages": [
    {
      "language": "Spanish",
      "fluency": "Native speaker"
    },
    {
      "language": "English",
      "fluency": "Professional Working Proficiency - B2 Belt Certified"
    }
  ],
  "interests": [
    {
      "name": "Arts and Culture",
      "keywords": ["Photography", "Literature"]
    },
    {
      "name": "Education",
      "keywords": ["Teaching", "Teamwork"]
    }
  ],
  "references": [
    {
      "name": "Heriberto Ureña (burenam17@gmail.com) - coworkers at SOIN",
      "reference": "It's my pleasure to recommend Francisco, we work together at SOIN and he proved that he will be a valuable professional to any company as web developer."
    },
    {
      "name": "Tomás González Castetbon - coworkers at SOIN",
      "reference": "I have worked with Francisco in several projects in the same company and I can say his seniority is highly-felt; one of the most committed & responsible person/teammate I have had the pleasure to work with. When it comes down to reviews/plannings, Francisco's input and ideas always tend to shine and are highly taken in consideration for the projects on focus."
    }
  ],
  "meta": {
    "theme": "kendall"
  }
}
